[
  {
    "_id": "62e6d8052701ac00e4192be5",
    "name": "Department of Algorithms and their Applications",
    "description": "Algorithms lie at the heart of computing. If we observe our surroundings, we can find several algorithms working to solve our daily life problems: Social media networks, GPS applications, Google search, e-commerce platforms, Netflix recommendation systems, etc. applications are powered by algorithms."
  },
  {
    "_id": "62e6d8052701ac00e4192be6",
    "name": "Department of Programming Languages And Compilers",
    "description": "A compiler is a special program that translates a programming language's source code into machine code, bytecode or another programming language. The source code is typically written in a high-level, human-readable language such as Java or C++"
  },
  {
    "_id": "62e6d8052701ac00e4192be8",
    "name": "Department of Data Science and Engineering",
    "description": "Data science is an interdisciplinary field that uses scientific methods, processes, algorithms and systems to extract knowledge and insights from noisy, structured and unstructured data, and apply knowledge from data across a broad range of application domains."
  },
  {
    "_id": "62e6d8052701ac00e4192be7",
    "name": "Department of Software Technology And Methodology",
    "description": "Software comprises the entire set of programs, procedures, and routines associated with the operation of a computer system. The term was coined to differentiate these instructions from hardware—i.e., the physical components of a computer system"
  },
  {
    "_id": "62e6d8052701ac00e4192be9",
    "name": "Department of Computer Algebra",
    "description": "In mathematics and computer science, computer algebra, also called symbolic computation or algebraic computation, is a scientific area that refers to the study and development of algorithms and software for manipulating mathematical expressions and other mathematical objects."
  },
  {
    "_id": "62e6d8052701ac00e4192bea",
    "name": "Department of Media and Educational Informatics",
    "description": "This Department deals with the research and university-level education in the convergent communication, information and media technologies."
  },
  {
    "_id": "62e6d8052701ac00e4192beb",
    "name": "Department of Information Systems",
    "description": "Computer information systems is the application of technology in managing the needs of businesses, so you'll get to put your technical skills to work in a business setting. Students in the computer information Systems major learn how to work with companies' IT systems to solve operations issues."
  },
  {
    "_id": "62e6d8052701ac00e4192bed",
    "name": "Department of Cartography And Geoinformatics",
    "description": "The purpose of Geographic Information Systems (GIS) is to manage information, conduct analysis, and produce knowledge by connecting or synthesizing data together using location as a common index."
  },
  {
    "_id": "62e6d8052701ac00e4192bec",
    "name": "Department of Numerical Analysis",
    "description": "Numerical analysis is a branch of mathematics that solves continuous problems using numeric approximation. It involves designing methods that give approximate but accurate numeric solutions, which is useful in cases where the exact solution is impossible or prohibitively expensive to calculate."
  }
]
